app/controllers/records_controller.rb

  def index
    @records = Record.all
---
SELECT `records`.* FROM `records`

  def create
    @record = Record.new(record_params)

    if @record.save
---
INSERT INTO `records` (`title`, `date`, `amount`, `created_at`, `updated_at`) VALUES ('Record 5', '2017-08-09', -50.0, '2017-08-08 08:10:07', '2017-08-08 08:10:07')

  def update
    @record = Record.find(params[:id])

    if @record.update(record_params)
---
SELECT  `records`.* FROM `records` WHERE `records`.`id` = 2 LIMIT 1
UPDATE `records` SET `amount` = -1000.0, `updated_at` = '2017-08-10 14:53:36' WHERE `records`.`id` = 2

  def destroy
    @record = Record.find(params[:id])
    @record.destroy
---
SELECT  `records`.* FROM `records` WHERE `records`.`id` = 10 LIMIT 1
DELETE FROM `records` WHERE `records`.`id` = 10